/**
 * Created by sunyx on 16-10-28.
 *
 * 扩展：计算机科学
 * 1.数学基础：数理逻辑  集合论  数论  图论  类型论  范畴论  数值分析  信息论
 *
 * 2.计算理论：自动机  可计算性理论  计算复杂性理论  量子计算  数值计算方法
 *
 * 3.算法和数据结构：算法分析  算法设计  计算几何
 *
 * 4.编程语言和编译器：语法分析器  解释器  编程范型（过程化编程  面向对象程序编程  函数式编程  逻辑编程）
 *
 * 5.并发，并行和分布式系统：多处理器，网格计算，并发控制
 *
 * 6.软件工程：需求分析，软件设计，程序设计，形式化方法，软件测试，软件开发过程
 *
 * 7.系统架构：电脑系统架构，微处理器体系结构，操作系统
 *
 * 8.电信与网络：路由，网络拓扑，密码学
 *
 * 9.数据库：数据库管理系统，关系数据库，结构化查询语言，nosql,事务处理，数据库索引，数据挖掘
 *
 * 10.人工智能：自动推理，计算语言学，计算机视觉，进化计算，专家系统，机器学习，自然语言处理，机器人学
 *
 * 11.计算机图形学：可视化，计算机动画，图像处理
 *
 * 12.人机交互：计算机辅助功能，用户界面，可穿戴计算机，普适计算，虚拟现实，聊天机器人
 *
 * 13.科学计算：人工生命，生物信息学，认知科学，计算化学，计算神经科学，计算物理学，数值算法，符号计算
 */
